Tekla Open API Reference for Tekla Structures 2025
LoadArea.AreaLoadFormEnum Enumeration
 The area load form.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum AreaLoadFormEnum
Public Enumeration AreaLoadFormEnum
Members
Member name | Value | Description
LOAD_FORM_AREA_PARALLELOGRAM | 1002 |  The area load form is a parallelogram.
LOAD_FORM_AREA_TRIANGLE | 1003 |  The area load form is a triangle.
See Also
Reference
Tekla.Structures.Model Namespace